import Skill from '../../server/models/typescript/skill';

export const skills: Skill[] = [
    {
        name: 'JavaScript',
        description: 'Сценарный язык программирования для веб-разработки'
    },
    {
        name: 'React',
        description: 'Популярная библиотека для создания пользовательских интерфейсов в веб-приложениях'
    },
    {
        name: 'Node.js',
        description: 'Среда выполнения JavaScript, построенная на движке JavaScript V8 Chrome'
    },
    {
        name: 'Python',
        description: 'Универсальный язык программирования, используемый для веб-разработки, анализа данных и машинного обучения'
    },
    {
        name: 'Docker',
        description: 'Платформа контейнеризации для развертывания и масштабирования приложений'
    },
    {
        name: 'Kubernetes',
        description: 'Открытая система оркестрации контейнеров для автоматизации развертывания, масштабирования и управления контейнеризованными приложениями'
    },
    {
        name: 'AWS',
        description: 'Amazon Web Services, облачная платформа, используемая для развертывания, управления и масштабирования веб-приложений'
    },
    {
        name: 'MongoDB',
        description: 'Популярная NoSQL-база данных, используемая для хранения и управления структурированными и неструктурированными данными'
    },
    {
        name: 'GraphQL',
        description: 'Язык запросов для API, разработанный для обеспечения более эффективной, мощной и гибкой альтернативы REST'
    },
    {
        name: 'Redux',
        description: 'Предсказуемый контейнер состояния для JavaScript-приложений'
    }
];
